app/Http/ViewComposers/AreaComposer.php

    public function compose(View $view)
    {
        // add us in config
        if (!$this->area) {
            $this->area = \App\Area::where('slug', session()->get('area', config()->get('believe.defaults.area')))->first();
---
select * from `areas` where `slug` = 'us' limit 1