app/Http/Controllers/HomeController.php

select * from `areas`
---
    public function index()
    {
        $areas = Area::get()->toTree();